{
    "data": [{
            "origin":"Israel",
            "feeScore": 4.4,
            "USStock":"0.0",
            "UkStock":"0.0",
            "GermanStock":"0.0",
            "DepositAndWithdrawal":3.4,
            "bastBroker":true,
            "basicData":"Recommended for Beginners looking for free trading and a great mobile-only trading platform",
            "description2": "traders interested in social trading (i.e. copying other investors’ trades) and zero commission stock trading. ",
            "description": "eToro is a global social trading broker. It is regulated by top-tier authorities such as the UK FCA or Australia's ASIC.",
            "link": "https://www.etoro.com/accounts/sign-up",
            "name": "eToro",
            "score": 4.8,
            "fromDescription":"eToro's service is on par with TradeStation's and a comparison of their fees shows that eToro's fees are slightly lower than TradeStation's. ",
            "fromDescription2":"Account opening takes about the same effort at eToro compared to TradeStation, deposit and withdrawal processes are more seamless at eToro, while customer service quality is somewhat lower than TradeStation's. ",
            "fromDescription3":"Our experts rated the trading platform of eToro as somewhat better than the platform of TradeStation, found that clients have access to more markets and products with eToro, while TradeStation provides somewhat better research and education"
        },
        {
            "origin":"USA",
            "feeScore": 4.0,
            "USStock":"1.0",
            "UkStock":"-",
            "GermanStock":"-",
            "DepositAndWithdrawal":2.3,
            "bastBroker":false,
            "basicData":"Recommended for Traders focusing on US markets and buy-and-hold investing",
            "description2": "traders focusing on US markets and buy-and-hold investing.",
            "description": "TradeStation is a US stockbroker regulated by FINRA, a top-tier US regulatory body.",
            "link": "https://getstarted2.tradestation.com/registration",
            "name": "TradeStation",
            "score": 4.5,
            "fromDescription":"",
            "fromDescription2":"",
            "fromDescription3":""
        },
        {
            "origin":"USA",
            "feeScore": 4.0,
            "USStock":"1.0",
            "UkStock":"-",
            "GermanStock":"-",
            "DepositAndWithdrawal":2.3,
            "bastBroker":false,
            "basicData":"Recommended for Traders focusing on US markets and buy-and-hold investing",
            "description2": "traders focusing on US markets and buy-and-hold investing.",
            "description": "TradeStation is a US stockbroker regulated by FINRA, a top-tier US regulatory body.",
            "link": "https://getstarted2.tradestation.com/registration",
            "name": "TradeStation",
            "score": 4.5,
            "fromDescription":"",
            "fromDescription2":"",
            "fromDescription3":""
        },
        {
            "origin":"Australia",
            "feeScore": 4.5,
            "USStock":"-",
            "UkStock":"-",
            "GermanStock":"-",
            "DepositAndWithdrawal":4.5,
            "bastBroker":false,
            "basicData":"Recommended for Forex traders who prefer the MetaTrader platform",
            "description2": "forex traders who prefer the MetaTrader platform.",
            "description": "Eightcap is an Australian forex broker. It is regulated by both ASIC and VFSC, and is available globally for clients.",
            "link": "https://portal.eightcap.com/en-US/auth/create-account",
            "name": "Eightcap",
            "score": 4.4,
            "fromDescription":"Eightcap's service is on par with eToro's and a comparison of their fees shows that Eightcap's fees are similar to eToro's.",
            "fromDescription2":"Account opening takes about the same effort at Eightcap compared to eToro, deposit and withdrawal processes are somewhat easier at Eightcap, while customer service quality is much better than eToro's. ",
            "fromDescription3":"Our experts rated the trading platform of Eightcap as somewhat worse than the platform of eToro, found that clients have access to much less markets and products with Eightcap, while eToro provides better research and education."
        },
        {
            "origin":"Switzerland",
            "feeScore": 2.4,
            "USStock":"25",
            "UkStock":"35",
            "GermanStock":"30",
            "DepositAndWithdrawal":4.8,
            "bastBroker":false,
            "basicData":"Recommended for Affluent investors who value safety and are OK with higher fees",
            "description2": "affluent investors who value safety and are OK with higher fees.",
            "description": "Swissquote is a Swiss online broker with a banking license. It is listed on the Swiss stock exchange and regulated by several authorities globally, including the top-tier UK FCA.",
            "link":"https://trade.swissquote.ch/signup/public/form/full/trading/individual?lang=en&mktName=MKT_DEFAULT&l=e&trackPageId=obmh77ylioti9wkq3poeb55qr*7614122369&cookieId=undefined&sessionId=obmh77ylioti9wkq3poeb55qr&_ga=2.201746905.994422108.1662696527-372912613.1662696513#full/trading/individual/step2",
            "name": "Swissquote",
            "score": 4.6,
            "fromDescription":"",
            "fromDescription2":"",
            "fromDescription3":""
        },
        {
            "origin":"Cyprus",
            "feeScore": 4.4,
            "USStock":"0",
            "UkStock":"0",
            "GermanStock":"0",
            "DepositAndWithdrawal":4.5,
            "bastBroker":false,
            "basicData":"Recommended for Investors and CFD traders looking for a great trading platform and excellent customer service",
            "description2": "investors and CFD traders looking for a great trading platform and excellent customer service.",
            "description": "Capital.com is a global CFD broker, regulated by the FCA, CySEC, NBRB, and ASIC.",
            "link":"https://capital.com/",
            "name": "Capital.com",
            "score": 4.7,
            "fromDescription":"Capital.com's service is on par with eToro's and a comparison of their fees shows that Capital.com's fees are similar to eToro's. ",
            "fromDescription2":"Account opening takes about the same effort at Capital.com compared to eToro, deposit and withdrawal processes are somewhat easier at Capital.com, while customer service quality is much better than eToro's. ",
            "fromDescription3":"Our experts rated the trading platform of Capital.com as being of the same quality as the platform of eToro, found that clients have access to slightly less markets and products with Capital.com, while eToro provides just about the same quality of research and education."
        }

    ]
}